app/mailers/user_mailer.rb

  def welcome_email(id)
    @user = User.find(id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]