app/controllers/cars_controller.rb

  def create
    @car = Car.new(car_params)

    if @car.save
---
INSERT INTO "cars" ("brand", "model", "colour", "car_number", "car_owner", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    @car = Car.find(params[:id])

    if @car.update(car_params)
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "cars" SET "brand" = $1, "model" = $2, "colour" = $3, "car_number" = $4, "updated_at" = $5 WHERE "cars"."id" = $6  [["brand", "mercedez Benz"], ["model", "320 d s class"], ["colour", "black"], ["car_number", "MP-09-1111"], ["updated_at", "2022-12-21 06:19:20.140774"], ["id", 6]]

  def destroy
    @car = Car.find(params[:id])
    @car.destroy
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "cars" WHERE "cars"."id" = $1  [["id", 3]]