app/controllers/cars_controller.rb

  def index
    @q = current_user.cars.ransack(params[:q])
    @cars = @q.result(distinct: true).page(params[:page])
---
SELECT DISTINCT "cars".* FROM "cars" WHERE "cars"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 2], ["LIMIT", 25], ["OFFSET", 0]]