app/controllers/parkings_controller.rb

  def index
    @parking = Parking.all
---
SELECT "parkings".* FROM "parkings"

  def show
    @parking = Parking.find(params[:id])
---
SELECT "parkings".* FROM "parkings" WHERE "parkings"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def create
    @parking = Parking.new(parking_params)
    if @parking.save
---
INSERT INTO "parkings" ("maximum_size", "security_provision", "parking_duration", "chance_to_get_parking", "parking_cost_per_hour", "average_departure_time", "type_of_parking_facility", "type_of_security", "distance_to_supermarket", "distance_from_stores", "car_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def destroy
    @parking = Parking.find(params[:id])
    @parking.destroy
---
SELECT "parkings".* FROM "parkings" WHERE "parkings"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
DELETE FROM "parkings" WHERE "parkings"."id" = $1  [["id", 13]]